schemes['biology'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['生物学', '分子', '有机物'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['进化树', '分类树'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['邹承鲁', '阐明生命现象的规律，必须建立在阐明生物大分子结构的基础上。'],
        ['达尔文', '物竞天择,适者生存。'],
        ['摩尔根', '在生殖细胞形成时，一对同源染色体上的不同对等位基因之间可以发生交换。'],
        ['孟德尔', '一对染色体上的等位基因与另一对染色体上的等位基因的分离或组合是彼此间互不干扰的，各自独立地分配到配子中去。'],
        ['鲁道夫·魏尔肖', '细胞是一个相对独立的单位，既有它自己的生命，又对与其他细胞共同组成的整体的生命起作用。'],
        ['西德尼·奥尔特曼', '最早的生命物质是同时具有生物催化功能和遗传功能的RNA。'],
        ['萨克斯', '绿叶中的色素在叶绿体。'],
        ['罗伯特梅', '越是复杂的系统，各个物种越难趋于稳定，其种群大小的波动越大。'],
        ['林德曼', '同一条食物链上各营养级之间能量的转化效率平均大约为百分之十左右。'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['直觉', '分析', '统一', '唯心'],
    //至少3个有关第一个学科的性质
    prop: ['统一', '多样', '少利多害', '普遍'],
    //至少6个有关第一个学科的概念
    conc: ['自然选择理论', '连锁互换定律', '基因分离定律', '假说-演绎法', '内环境稳态', '生态系统稳定性'],
    init: function (){
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
