schemes['buddhism'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['佛学', '道', '心'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['雷峰塔', '大雁塔', '五台山'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['善导大师', '如来所以兴出世，唯说弥陀本愿海。'],
        ['六祖惠能', '菩提本无树，明镜亦非台，本来无一物，何处惹尘埃。'],
        ['《佛说十善业道经》', '慈庄严故，于诸众生不起恼害；悲庄严故，悯诸众生，常不厌舍；喜庄严故，见修善者，心无嫌嫉；舍庄严故，於顺违境，无爱恚心。'],
        ['《金刚经》', '一切有为法，如梦幻泡影，如露亦如电，应作如是观。'],
        ['《般若波罗蜜多心经》', '色不异空，空不异色；色即是空，空即是色。'],
        ['《涅盘经》', '人身难得，如优昙花。得人身者，如爪上土；失人身者，如大地土。'],
        ['七佛通戒偈', '诸恶莫作，诸善奉行；自净其意，是诸佛教。'],
        ['斌宗法师', '人身难得今已得，佛法难闻今已闻，此身不向今生度，更待何时度此身？'],
        ['《无量寿经》', '善护口业，不讥他过；善护身业，不犯律仪；善护意业，清净无染。'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['构造', '直觉', '不可知', '人文'],
    //至少3个有关第一个学科的性质
    prop: ['生命', '思想', '人格', '社会'],
    //至少6个有关第一个学科的概念
    conc: ['轮回', '开悟', '涅槃', '三法印', '四圣谛', '十二因缘'],
    init: function (){
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
