schemes['investment'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['投资学', '金融学', '经济学'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['K线图', '价值成长'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['沃伦·巴菲特', '你不需要每次都挥棒，你只需要等待最佳的击球点，全力击打。'],
        ['段永平', '我不会去做固定收益的东西。固定收益的东西长期肯定是输给通胀的，所以长期来说是件错的事情。'],
        ['菲利普·费雪', '股票投资，难免有些地方需要靠运气，但长期而言，好运、倒霉会相抵，想要持续成功，必须靠技能和运用良好的原则。'],
        ['彼得·林奇', '投资是令人激动和愉快的事，但如果不作准备，投资也是一件危险的事情。'],
        ['但斌', '投资不需要高等数学，只需要常识和智慧。'],
        ['章盟主', '如果你没有耐心，那你注定在股市一无所获。'],
        ['林园', '投资股市的本质，就是投资挣钱的企业。'],
        ['本杰明·格雷厄姆', '股市从短期来看是 「投票机」，从长期来看则是 「称重机」。'],
        ['乔治·索罗斯', '世界经济史是一部基于假象和谎言的连续剧。要获得财富，做法就是认清其假象，投入其中，然后在假象被公众认识之前退出游戏。'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['短期', '投机', '非理性'],
    //至少3个有关第一个学科的性质
    prop: ['趋利避害', '成长', '确定'],
    //至少6个有关第一个学科的概念
    conc: ['价值投资', '投资回报', '安全边际', '行业景气度', '企业成长', '有效市场假说'],
    init: function () {
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
