schemes['taichi'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['混元形意太极', '传统武学', 'MMA'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['太极门'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['马保国', '同志你没有学会接化发，就不要高估你的功夫'],
        ['马掌门', '武林要以和为贵，要讲武德，不要搞窝里斗'],
        ['马保国', '这个有用，这是化劲儿，传统功夫是讲化劲儿的，四两拨千金'],
        ['马掌门', '来，骗！来，偷袭！'],
        ['马保国', '中国正宗的传统功夫，比西方唉姆唉姆埃搏击术要好的多'],
        ['马掌门', '马家功夫没有套路，只有散手'],
        ['马保国', '接手就是你出拳，我来接你的手'],
        ['马保国', '一鞭，两鞭，三鞭，四鞭，五鞭，这五鞭，要连锁打'],
        ['马保国', '看第二个鞭，第三个鞭肯定倒'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['接化发', '套路', '散手'],
    //至少3个有关第一个学科的性质
    prop: ['小聪明', '武德', '打鞭'],
    //至少6个有关第一个学科的概念
    conc: ['闪电五连鞭', '接，化，发', '耗子尾汁', '左正蹬', '右鞭腿', '左刺拳'],
    init: function (){
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}