schemes['White_Album'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['白学', '牛头人', '修罗场'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['白色相簿', '白色相簿2', '白学', '届不到的爱', '修罗场', '三角关系'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['鲁迅', '我即使是死了，钉在棺材里了，也要在墓里，用这腐朽的声带喊出：“冬马小三！”'],
        ['冬马和纱', '又到了白色相簿的季节。'],
        ['冬马和纱', '为什么你会这么熟练啊！你和雪菜亲过多少次了啊！？你到底要把我甩开多远你才甘心啊！？'],
        ['冬马和纱', '是我，是我先，明明都是我先来的……接吻也好，拥抱也好，还是喜欢上那家伙也好。'],
        ['小木曾雪菜', '为什么会变成这样呢……第一次有了喜欢的人。有了能做一辈子朋友的人。两件快乐事情重合在一起。而这两份快乐，又给我带来更多的快乐。得到的，本该是像梦境一般幸福的时间……但是，为什么，会变成这样呢……'],
        ['周树人', '其实世上本没有白学家，研究得多了，也便成了白学家。'],
        ['终章', '白色相簿什么的已经无所谓了。因为已经不再有歌，值得去唱了。传达不了的恋情已经不需要了。因为已经不再有人，值得去爱了。'],
        ['早乙女阿尔特', '你们都是我的翅膀！'],
        ['届かない恋', '这份爱恋，便无法拥有未来'],
        ['届かない恋', '如何才能，在你心中，深深铭刻我的名字？'],
        ['届かない恋', '你是那么，炫目耀眼，让我无法，直视着你'],
        ['届かない恋', '你是否在，佯装孤独? 为何令人，无法释怀'],
        ['届かない恋', '不经意间，回过神来，我已深深，被你吸引'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['冬马小三', '雪菜碧池', '冬三雪碧', '都是翅膀'],
    //至少3个有关第一个学科的性质
    prop: ['玩梗', '娱乐', '广泛', '三角'],
    //至少6个有关第一个学科的概念
    conc: ['党政', '股票', '优柔寡断', '无法传达的爱恋', '白学家', '百合', '博爱党', '届不到', '三角恋'],
    init: function () {
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
