schemes['winnie'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['维尼学', '膜学', '督学'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['庆丰包子铺', 'G20峰会', '花瓶戴表'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['维尼', '在国际金融风暴中，维尼国能够基本解决13亿人口的吃饭问题，已经是对全人类最伟大的贡献。'],
        ['维尼', '有些吃饱了没事干的外国人，维尼国一不输出革命，二不输出饥饿和贫困，三不去折腾你们，还有什么好说的。'],
        ['维尼', '轻关易道，通商宽衣。'],
        ['维尼', '维尼国不输出革命，只撒币。'],
        ['维尼', '我最关心的就是困难群众。'],
        ['维尼', '我走十里山路，挑两百斤麦子，都不带换肩的。'],
        ['维尼', '金科律玉，颐使气指。'],
        ['维尼', '对于这次疫情防控工作，我一直是在亲自指挥，亲自部署。'],
        ['维尼', '维尼国人均国内生产总值接近八千万美元。'],
		['维尼', '金砖合作之所以得到快速发展，不仅在于找准了合作之道，关键是在于找准了合作之道。'],
		['维尼', '维尼国不以追求贸易逆差为目标，真诚希望扩大进口，促进经常项目收支平衡。'],
		['维尼', '维尼国人民是具有伟大创造精神的人民。在几千年历史长河中，中国人民始终辛勤劳作、发明创造……传承了萨格尔王、玛纳斯、江格尔等震撼人心的伟大史诗。'],
		['维尼', '广大澳门同胞发自内心拥护“一国两制”，认同“一国两制”是香港保持长期繁荣稳定的最佳制度。'],
		['维尼', '天行健君子以不强自自强不息。'],
		['维尼', '在维尼国这样一个有着五千多年文明史，十三亿多人口的大国推进改革发展，没有可以奉为金科律玉的教科书，也没有可以对维尼国人民颐使气指的教师爷。'],
		['维尼', '说到体育活动，我喜欢游泳、爬山等运动，游泳我四、五岁就学会了。'],
		['维尼', '我就是游泳，散步，每天的话我游一千米，保持这个（运动）。我听说你（运动）蛮多的。如果不运动，我们会崩溃。'],
		['维尼', '我年轻的时候练过拳击。刚才看他那个勾拳还是比较好，咱们国家运动员用勾拳的不多，你看欧洲运动员的勾拳还是很有威胁。直拳摆拳还可以。'],
		['维尼', '50多年前我就在这个地方踢过球。那时候还是土场子。我们的球队在北京市比赛中拿过冠军，在全国比赛得了第四名。'],
		['维尼', '看我现在身体这么好，都是小时候体育运动打下的基础。'],
		['维尼', '一个举重运动员，最开始只能举起50公斤的杠铃，经过训练，最后可以举起250公斤。'],
		['维尼', '小时候在北京，那个时候其实沙尘也很大，戴着口罩骑车去上学。到学校之后，口罩上都是厚厚的黄沙子。到了冬天，加上煤烟气，情况就更糟了，那个时候没有PM2.5，但是有PM250。'],
		['维尼', '别看你今天闹得欢，小心啊今后拉清单。这都得应验的！不要干这种事情。‘头上三尺有神明’，一定要有敬畏之心。'],
		['维尼', '我读过很多俄罗斯作家的作品，如克雷洛夫、普希金、果戈里、莱蒙托夫、屠格涅夫、陀思妥耶夫斯基、涅克拉索夫、车尔尼雪夫斯基、托尔斯泰、契诃夫、肖洛霍夫，他们书中许多精彩章节和情节我都记得很清楚。'],
		['维尼', '读孟德斯鸠、伏尔泰、卢梭、狄德罗、圣西门、傅立叶、萨特等人的著作，让我加深了对思想进步对人类社会进步作用的认识。读蒙田、拉封丹、莫里哀、司汤达、巴尔扎克、雨果、大仲马、乔治·桑、福楼拜、小仲马、莫泊桑、罗曼·罗兰等人的著作，让我增加了对人类生活中悲欢离合的感触。冉阿让、卡西莫多、羊脂球等艺术形象至今仍栩栩如生地存在于我的脑海之中。欣赏米勒、马奈、德加、塞尚、莫奈、罗丹等人的艺术作品，以及赵无极中西合璧的画作，让我提升了自己的艺术鉴赏能力。'],
		['维尼', '只要我们13亿多人民和衷共济，只要我们党永远同人民站在一起，大家撸起袖子加油干，我们就一定能够走好我们这一代人的长征路。'],
		['维尼', '维尼经济是一片大海，而不是一个小池塘。大海有风平浪静之时，也有疯狂宇宙（风狂雨骤）之时。没有风狂雨骤，那就不是大海了。狂风骤雨可以掀翻小池塘，但不能掀翻大海。经历了无数次狂风骤雨，大海依旧在那儿。'],
		['维尼', '希望同各方一道，绘制精甚细腻的工笔画，让共建一带一路走深走实。'],
		['维尼', '现在防控还不能麻痹。'],
		['维尼', '溅得我满脸喷粪啊，满脸是粪。'],
		['维尼', '新冠肺炎疫情突如其来，现在已经波及（pō jī/ㄆㄛ ㄐㄧ）210多个国家和地区。'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['维尼新时代特色社会主义', '坚持维尼的绝对领导', '维尼特色冰棒外交'],
    //至少3个有关第一个学科的性质
    prop: ['无限连任', '独立自主', '岿（音kui）然不动'，'小学文化'],
    //至少6个有关第一个学科的概念
    conc: ['通商宽衣', '冰棒外交', '一日千米', '报菜名', '不强自息', '精甚细腻', '满脸喷粪'， '左手敬礼'，'拉不开弓'],
    init: function (){
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
