schemes['成功学'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['成功学', '关系学', '企业管理'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['更大气场', '更高境界', '优秀习惯', '老板之心', '风口', '大局观'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['费拉尔·凯普', '敢于担当的人，阳光与自信扑面而来。不负责任的人生，虽然简单，轻松，但却并不会成功。'],
        ['布瑞斯・巴勃', '负责是做好工作的最重要的一步。成功与责任，始于无处不担当。'],
        ['费拉尔·凯普', '把工作上的事当成自己的事，主动、积极、负责、奉献、坚持，追求成功、永不言败。'],
        ['保罗·托马斯', '要发扬主人翁精神，把公司当成自己的家, 与公司共同成长，共同进步。'],
        ['杰·瑞芬伯', '忠于企业，爱岗敬业，处处维护公司的大家庭利益，自觉为家着想。'],
        ['威尔·鲍温', '忠诚与责任，是一个人最重要的职业素养与基本的品质 。'],
        ['大卫·伯恩', '工作的时候，不妨把自己当作老板，替老板考虑，关注公司的大局发展。'],
        ['皮特.格鲁克', '借口的代价无比的昂贵，它给我们带来的危害一点也不比其他任何恶习少。'],
        ['比尔.卡耐基', '凡事都只求“差不多”，天长日久就会“差很多”，结果不但会贻误个人的成长良机，更可能影响公司事业的发展。'],
        ['大岛祥誉', '懦的工作不是抱怨，而是解决问题。我的工作不是推卸责任，而是创造价值。'],
        ['施伟德', '公司要给客户创造价值，就不能容忍缺陷存在。我们要坚持第一次就把事情做对做正确。'],
        ['劳伦斯·彼得', '在负责与执行之前，首先想一想，这样对公司有什么益处？我还可以做得更好吗？'],
        ['阿尔伯特·哈伯德', '老板需要什么样的员工？公司需要什么样的员工？答案是：能够比别人更快的达到目的。'],
        ['艾森·拉塞尔', '对于工作也是这样，只有我们定极高的标准，我们才能够做好。'],
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['公司至上', '客户至上', '成功'],
    //至少3个有关第一个学科的性质
    prop: ['忠诚', '竞争', '盈利'],
    //至少6个有关第一个学科的概念
    conc: ['完全责任', '使命必达', '主人翁意识', '精益求精', '独立负责', '卓越精神', '习惯于优秀', '必成必成', '公司大局观'],
    init: function () {
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
