schemes['真物'] = {
    //三个学科 其中第一个是主学科 后两个是相关学科
    subj: ['真物', '春学', '白学'],
    //至少1个有关第一个学科的 字面上可以解释为物理结构的词
    stru: ['真物', '伪物', 'Max咖啡'],
    //至少9个有关第一个学科的名人名言
    cele: [
        ['比企谷八幡', '温柔正确的人总是难以生存，因为这世界既不温柔，也不正确。'],
        ['比企谷八幡', '没有期望就没有失望，没有羁绊就不会受伤。'],
        ['比企谷八幡', '误解是解不开的。既然‘解’已经得出了，那么问题就到此为止了。再解下去也解不了。'],
        ['雪之下雪乃', '只要亲密的人理解我就好了，别人怎么想我无所谓。'],
        ['雪之下雪乃', '什么都创造不出来，什么都得不到，什么都给予不了，只不过是伪物。'],
        ['回顾高中生活', '青春是一场谎言、一种罪恶。'],
        ['回顾高中生活', '结论就是：现充通通给我爆炸吧！'],
        ['回顾高中生活重写版本', '那么，我现在所处的位置，是否也会有充满光辉的一天？我的这双死鱼眼也是。会抱持这种期待，代表我的内心有某种东西正在萌生。'],
        ['真物宣言', '我想要的东西，确实存在。']
    ],
    //至少3个有关第一个学科的思想（主义）
    prin: ['雪崩', '团灭', '百合'],
    //至少3个有关第一个学科的性质
    prop: ['三角', '党争', '广泛'],
    //至少6个有关第一个学科的概念
    conc: ['青春', '现充', '真物', '伪物', '百合', '股票', '三角恋', '依赖'],
    init: function () {
        shuffle(this.stru);
        shuffle(this.cele);
        shuffle(this.prin);
        shuffle(this.prop);
        shuffle(this.conc);
    }
}
